package com.example.administrator.essim.fragments_re;

import android.support.v4.app.Fragment;
import android.support.v4.app.FragmentStatePagerAdapter;
import android.support.v4.view.ViewPager;
import android.view.View;
import android.widget.ImageView;
import android.widget.TextView;

import com.bumptech.glide.Glide;
import com.example.administrator.essim.R;
import com.example.administrator.essim.utils_re.CustPagerTransformer;

import java.util.ArrayList;
import java.util.List;
import java.util.Random;

import jp.wasabeef.glide.transformations.BlurTransformation;

public class FragmentNews extends BaseFragment {

    private ViewPager mViewPager;
    private TextView mTextView;
    private static final String[] TITLES = new String[]{"动态", "榜单", "特辑"};
    //从背景墙随机抽取3张图来填充"动态", "榜单", "特辑" 这三张卡片
    //可以向像面这样直接写死，也可以调用这个接口

    //http://65.49.235.124:8080/unibest_war/all

    public static final String[] ILLUST_ID = new String[]{
            "2012/09/29/13/38/30/30441213",
            "2015/05/24/01/37/35/50528486",
            "2015/01/09/04/59/07/48053793",
            "2013/05/09/17/23/53/35570299",
            "2011/11/16/00/47/45/23087254",
            "2012/09/03/02/39/18/29860639",
            "2015/11/11/00/23/55/53488982",
            "2010/05/18/23/54/25/10731349",
            "2011/03/08/08/59/38/17214248",
            "2014/08/19/00/13/35/45444349",
            "2011/03/07/00/37/33/17184292",
            "2015/11/04/01/57/38/53376288",
            "2011/09/06/07/59/50/21574388",
            "2015/11/11/15/28/20/53496095",
            "2012/01/08/19/18/33/24244579",
            "2014/08/20/00/13/24/45464867",
            "2013/08/22/21/34/34/37993338",
            "2013/03/04/03/08/16/33986574",
            "2014/05/01/04/28/08/43216803",
            "2014/12/26/12/02/57/47773952",
            "2013/09/20/17/53/12/38631998",
            "2013/09/11/00/39/32/38431299",
            "2016/07/28/09/00/00/58122126",
            "2015/11/07/19/35/44/53428576",
            "2015/05/29/02/41/26/50606272",
            "2011/07/18/10/09/25/20395376",
            "2016/03/25/18/43/00/56001614",
            "2014/09/28/00/04/27/46221486",
            "2011/09/27/09/35/05/22025728",
            "2011/12/03/00/04/28/23419930",
            "2012/10/22/00/31/43/30971623",
            "2014/02/07/00/04/28/41440438",
            "2013/09/17/00/16/53/38566067",
            "2010/08/09/01/11/25/12438583",
            "2013/02/12/18/56/07/33518302",
            "2012/06/21/00/00/40/28102095",
            "2016/09/17/21/50/08/59031459",
            "2012/08/01/16/51/23/29037981",
            "2011/08/31/17/13/46/21440268",
            "2014/04/22/17/48/23/43040228",
            "2013/06/08/00/36/27/36224612",
            "2014/02/22/00/27/29/41783556",
            "2014/01/24/00/02/56/41139423",
            "2014/04/13/13/50/07/42866322",
            "2014/08/02/00/09/12/45068168",
            "2015/11/11/13/33/49/53495177",
            "2015/11/05/00/01/35/53388604",
            "2014/03/15/00/08/18/42238652",
            "2015/08/28/13/03/31/52231018",
            "2015/06/30/00/47/30/51160511",
            "2012/01/19/18/22/41/24471556",
            "2012/10/05/00/33/22/30581472",
            "2010/05/25/01/12/04/10859558",
            "2015/11/11/00/41/00/53489440",
            "2015/11/11/00/00/10/53488027",
            "2015/11/25/20/49/28/53737603",
            "2011/02/02/07/51/26/16347313",
            "2011/02/07/00/30/49/16471848",
            "2013/06/25/20/32/44/36633503",
            "2011/10/13/01/27/33/22350647",
            "2016/07/12/00/01/28/57862620",
            "2012/04/08/10/38/50/26424396",
            "2008/11/14/00/26/04/2124805",
            "2014/03/13/15/11/11/42203380",
            "2015/06/02/01/24/38/50680532",
            "2015/12/22/00/48/38/54156275",
            "2016/09/25/01/05/27/59153310",
            "2016/07/01/19/23/59/57681432",
            "2014/06/16/11/03/31/44108346",
            "2010/10/29/17/48/55/14184347",
            "2011/02/18/01/19/35/16761969",
            "2016/06/12/00/13/18/57350017",
            "2014/04/12/08/19/46/42840291",
            "2015/11/11/03/02/18/53491663",
            "2016/06/08/20/37/44/57291740",
            "2014/07/23/02/51/47/44876609",
            "2011/06/30/12/29/59/19982051",
            "2015/06/02/19/39/27/50688289",
            "2015/02/13/18/33/11/48723512",
            "2013/03/06/00/57/00/34025296",
            "2013/12/09/00/08/14/40180063",
            "2011/04/07/00/26/55/17974103",
            "2014/10/26/02/35/14/46734725",
            "2011/12/24/06/18/24/23846900",
            "2013/12/15/18/03/17/40294767",
            "2012/12/09/00/08/15/31993051",
            "2016/04/06/04/14/32/56213875",
            "2016/06/22/00/46/45/57526556",
            "2010/09/25/00/08/06/13461444",
            "2015/01/31/05/02/29/48466332",
            "2012/08/02/00/04/13/29049814",
            "2013/12/29/03/09/42/40586045",
            "2010/09/28/04/07/27/13534647",
            "2011/09/26/00/49/32/22002501",
            "2010/12/05/17/00/59/15002788",
            "2014/01/29/00/34/06/41244310",
            "2013/05/03/14/53/43/35422846",
            "2012/09/26/18/36/21/30384793",
            "2013/11/26/19/25/01/39957555",
            "2015/01/19/05/16/00/48256902",
            "2013/02/23/20/06/42/33787607",
            "2014/03/10/10/39/19/42140983",
            "2012/07/17/00/00/47/28680466",
            "2015/02/04/17/35/29/48552958",
            "2013/12/15/13/30/15/40289952",
            "2014/01/05/00/10/25/40761380",
            "2015/10/28/19/00/13/53250514",
            "2015/11/11/15/51/44/53496279",
            "2014/12/12/01/36/09/47514040",
            "2015/04/23/01/02/03/49979385",
            "2016/03/18/20/29/20/55877322",
            "2014/06/10/20/15/06/42208869",
            "2014/10/30/22/25/38/46808609",
            "2014/10/25/10/20/50/46718715",
            "2015/09/23/20/06/31/52677282",
            "2014/08/26/12/01/27/44920385",
            "2015/05/14/03/07/50/50364986",
            "2010/01/24/21/45/07/8369938",
            "2013/09/24/20/20/33/38722881",
            "2014/06/30/00/20/02/44403643",
            "2013/05/19/00/39/07/35782590",
            "2013/05/24/17/27/05/35902979",
            "2013/02/15/19/23/17/33598021", };


    @Override
    void initLayout() {
        mLayoutID = R.layout.fragment_news;
    }

    @Override
    View initView(View v) {
        mTextView = v.findViewById(R.id.title_text);
        mViewPager = v.findViewById(R.id.view_pager);
        return v;
    }

    @Override
    void initData() {
        List<Integer> threeIllust = getRandomNumList(TITLES.length,0,ILLUST_ID.length);
        mViewPager.setPageTransformer(false, new CustPagerTransformer(mContext));
        mViewPager.setAdapter(new FragmentStatePagerAdapter(getChildFragmentManager()) {
            @Override
            public Fragment getItem(int position) {
                return FragmentCard.newInstance(position, ILLUST_ID[threeIllust.get(position)]);
            }

            @Override
            public int getCount() {
                return TITLES.length;
            }
        });
        mViewPager.addOnPageChangeListener(new ViewPager.OnPageChangeListener() {
            @Override
            public void onPageScrolled(int position, float positionOffset, int positionOffsetPixels) {
            }

            @Override
            public void onPageSelected(int position) {
                mTextView.setText(TITLES[position]);
            }

            @Override
            public void onPageScrollStateChanged(int state) {

            }
        });
        mViewPager.setCurrentItem(1);
    }

    public static List<Integer> getRandomNumList(int nums, int start, int end){
        //1.创建集合容器对象
        List<Integer> list = new ArrayList<>();

        //2.创建Random对象
        Random r = new Random();
        //循环将得到的随机数进行判断，如果随机数不存在于集合中，则将随机数放入集合中，如果存在，则将随机数丢弃不做操作，进行下一次循环，直到集合长度等于nums
        while(list.size() != nums){
            int num = r.nextInt(end-start) + start;
            if(!list.contains(num)){
                list.add(num);
            }
        }

        return list;
    }

    @Override
    void getFirstData() {

    }

    @Override
    void getNextData() {

    }
}
